Revit 2027 API
eRefFace Enumeration
Indicates the reference face. The Opening will be created at the direction perpendicular to the reference face.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum eRefFace
Public Enumeration eRefFace
public enum class eRefFace
type eRefFace
Members
Member name | Value | Description
CenterX | 1 | The reference face is at the middle of the element in the direction of x-axis and its normal is parallel to x-axis.
CenterY | 4 | The reference face is at the middle of the element in the direction of y-axis and its normal is parallel to y-axis.
CenterZ | 7 | The reference face is at the middle of the element in the direction of z-axis and its normal is parallel to z-axis.
Remarks
Direction of the opening.
See Also
Reference
Autodesk.Revit.Creation Namespace